Updour/smart-farming/esp32_server_receiver/esp32_server_receiver.ino
#include "index.h"
#include <DHT.h>
#include <LittleFS.h>
#include <WebServer.h>
#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h> // UNTUK LOCK CHANNEL RADIO PHY ESP32 & DONGKRAK POWER MAKSIMAL

// --- KONFIGURASI DHT, RELAY (PIN 26 KHUSUS) & TRAFFIC LIGHT ---
#define DHTPIN 4
#define DHTTYPE DHT11

// RELAY PADA PIN 26 (DS1 / RELAY PIN 26)
#define RELAY1 26

// SETELAN ACTIVE LOW (LOW = ON, HIGH = OFF)
#define RELAY_ON_STATE LOW
#define RELAY_OFF_STATE HIGH

// LAMPU INDIKATOR TRAFFIC LIGHT (PIN 32 HIJAU, 33 KUNING, 27 MERAH)
#define LED_HIJAU 32
#define LED_KUNING 33
#define LED_MERAH 27

DHT dht(DHTPIN, DHTTYPE);

const float batasSuhu = 30.0;  // Batas Hangat
const float suhuBahaya = 35.0; // Batas Bahaya Panas Ekstrem

typedef struct struct_message {
  int8_t persen;   // 0 - 100%
  int8_t baterai;  // 0 - 100%
  uint16_t rawAdc; // Nilai Mentah Analog ADC (Misal: 620)
} struct_message;

struct_message myData;

volatile bool newDataReceived = false;
int8_t latestMoisturePercent = -1; // -1 ARTINYA BELUM ADA DATA MENDARAT
int8_t esp8266Battery = 0;
uint16_t latestRawAdc = 0;
unsigned long lastRecvTime = 0;
int8_t esp8266Rssi = -99;

// Data Cuaca Lokal (DHT11) - Default Fallback 28.0 C (Adem)
float lastSuhuC = 28.0;
float lastSuhuF = 82.4;
float lastKelembapanUdara = 65.0;
float lastHeatIndexC = 28.5;
float lastHeatIndexF = 83.3;
float lastDewPoint = 21.0;

// Data Cuaca Satelit (Disuntikkan via Web)
String satTemp = "-";
String satDesc = "-";
String satRainPred = "Cerah / Tidak Ada Hujan";
String satTime = "-";

// --- VARIABEL ERROR & PERINGATAN DICABUT ---
String systemErrorMsg = "";
bool isSystemError = false;
bool isStartupWaiting = true;
bool wasInErrorState = false;
unsigned long startupWaitStartTime = 0;
uint8_t waitingPercent = 0; // COUNTER PERSEN MENUNGGU (0% - 100%)

bool isEsp8266Unplugged = false; // FLAG PERINGATAN ESP8266 DICABUT
bool isRelayUnplugged = false;   // FLAG PERINGATAN RELAY PIN 26 DICABUT

// --- TIMER RELAY & PRO COUNTER ---
unsigned long relayStartTime = 0;
bool isRelayOn = false;
bool relayCooldown = false;
const unsigned long MAX_RELAY_TIME = 20UL * 60UL * 1000UL; // 20 Menit

uint32_t pumpCount = 0;
unsigned long totalPumpSecs = 0;
unsigned long lastPumpSecUpdate = 0;

// --- COUNTER UNTUK LOG DATABASE ---
uint16_t hourlyPumpCount = 0;
uint32_t hourlyPumpSecs = 0;

// --- KENDALI WEB MANUAL ---
bool isManualMode = false;
bool manualRelayState = false;

// --- TIMER PENCATATAN MEMORI (LITTLEFS) ---
unsigned long lastLogTime = 0;
const unsigned long LOG_INTERVAL = 60UL * 60UL * 1000UL;

WebServer server(80);

// Helper Uptime Sistem
String getUptime() {
  unsigned long sec = millis() / 1000;
  unsigned long d = sec / 86400;
  unsigned long h = (sec % 86400) / 3600;
  unsigned long m = (sec % 3600) / 60;
  unsigned long s = sec % 60;
  if (d > 0)
    return String(d) + "d " + String(h) + "h " + String(m) + "m";
  if (h > 0)
    return String(h) + "h " + String(m) + "m " + String(s) + "s";
  return String(m) + "m " + String(s) + "s";
}

// Helper Klasifikasi Kategori Kondisi Tanah
String getSoilCategory(int8_t moisture) {
  if (moisture < 0)
    return F("❌ SENSOR TIDAK TERHUBUNG");
  if (moisture >= 90)
    return F("🌊 SANGAT BASAH / TERGENANG");
  if (moisture >= 65)
    return F("🌱 SANGAT LEMBAB (IDEAL SUBUR)");
  if (moisture >= 45)
    return F("☘️ LEMBAB OPTIMAL");
  if (moisture >= 25)
    return F("🍂 TANAH MULAI KERING");
  return F("🍂 TANAH KERING (PERLU MENYIRAM)");
}

// Rumus Indeks Kesehatan Lahan (0 - 100%)
uint8_t calculateFarmHealth() {
  if (isSystemError || isEsp8266Unplugged || isRelayUnplugged || latestMoisturePercent < 0)
    return 0;
  int score = 100;
  if (latestMoisturePercent < 25)
    score -= 25;
  else if (latestMoisturePercent < 45)
    score -= 15;
  else if (latestMoisturePercent >= 90)
    score -= 15;

  if (lastSuhuC >= suhuBahaya)
    score -= 35;
  else if (lastSuhuC > batasSuhu)
    score -= 15;

  return constrain(score, 0, 100);
}

// Estimasi Laju Penguapan Air Tanah (% / Jam)
float calculateEvaporationRate() {
  if (lastSuhuC == 0.0)
    return 0.0;
  float rate = (lastSuhuC / 10.0) * (1.0 - (lastKelembapanUdara / 100.0)) * 2.5;
  return constrain(rate, 0.1, 15.0);
}

// Estimasi Jam/Hari Sisa Air Tanah Habis
String getSoilDepletionTime() {
  if (latestMoisturePercent < 0)
    return F("Sensor Hilang");
  if (latestMoisturePercent <= 25)
    return F("Sudah Waktunya Menyiram!");
  float evap = calculateEvaporationRate();
  if (evap <= 0.05)
    evap = 0.05;

  float remainingPercent = latestMoisturePercent - 25.0;
  float totalHours = remainingPercent / (evap * 0.35);

  int days = (int)(totalHours / 24.0);
  int remainingHours = (int)totalHours % 24;

  if (days > 0) {
    return "~" + String(days) + " Hari " + String(remainingHours) + " Jam";
  } else {
    return "~" + String(remainingHours) + " Jam";
  }
}

// Kesimpulan AI Diagnostik Kondisi Tanaman Real-Time
String getPlantHealthSummary() {
  if (isEsp8266Unplugged || latestMoisturePercent < 0)
    return F("🚨 [PERINGATAN TERPUTUS] ESP8266 DICABUT / MATI! Sinyal Hilang. Lampu Merah Berkedip! Pompa MUTLAK MATI!");
  if (isRelayUnplugged)
    return F("🚨 [PERINGATAN HARDWARE] KABEL RELAY (PIN 26) TERLEPAS / DICABUT!");
  if (isStartupWaiting)
    return "⏳ [INITIALIZING " + String(waitingPercent) + "%] Menunggu sinyal ESP8266... (Lampu Kuning Berkedip)";

  if (latestMoisturePercent >= 90) {
    return F("🛑 [INTERLOCK AKAR 90%] Tanah sangat basah (≥90%). Pompa dikunci OFF otomatis untuk mencegah pembusukan akar tanaman!");
  } else if (lastSuhuC >= suhuBahaya) {
    return "☀️ [KONDISI 1: BAHAYA PANAS] Suhu tinggi (" + String(lastSuhuC, 1) + "°C). Penyiraman darurat diaktifkan.";
  } else if (lastSuhuC > batasSuhu || latestMoisturePercent < 45) {
    return "🍂 [KONDISI 2: PERINGATAN MENYIRAM] Kelembapan tanah (" + String(latestMoisturePercent) + "%) & suhu (" + String(lastSuhuC, 1) + "°C). Pompa menyala menyiram.";
  } else {
    return "🌿 [KONDISI 3: AMAN & IDEAL] Suhu adem (" + String(lastSuhuC, 1) + "°C) & kelembapan tanah (" + String(latestMoisturePercent) + "%) ideal. Pompa MATI.";
  }
}

