Updour/smart-farming/esp32_server_receiver/esp32_server_receiver.ino
// CALLBACK UNIVERSAL ESP-NOW DENGAN UPDATE INSTAN SAAT PAKET TERIMA
void OnDataRecvInternal(const uint8_t *incomingData, int len) {
  if (len >= sizeof(myData)) {
    memcpy(&myData, incomingData, sizeof(myData));
    latestMoisturePercent = myData.persen;
    esp8266Battery = myData.baterai;
    latestRawAdc = myData.rawAdc;
    newDataReceived = true;
    lastRecvTime = millis();
    isStartupWaiting = false;
    isEsp8266Unplugged = false; // SINYAL HIDUP KEMBALI
    waitingPercent = 100;
  }
}

#if defined(ESP_IDF_VERSION_MAJOR) && ESP_IDF_VERSION_MAJOR >= 5
void esp_now_recv_info_t_wrapper(const esp_now_recv_info *info,
                                 const uint8_t *data, int len) {
  if (info && info->rx_ctrl)
    esp8266Rssi = info->rx_ctrl->rssi;
  OnDataRecvInternal(data, len);
}
#else
void esp_now_recv_info_t_wrapper(const uint8_t *mac, const uint8_t *data,
                                 int len) {
  esp8266Rssi = -60;
  OnDataRecvInternal(data, len);
}
#endif

void writeLogHeader() {
  File file = LittleFS.open("/log.csv", FILE_WRITE);
  if (file) {
    file.println(
        F("Waktu,Suhu_Lokal(C),Kelembapan_Udara(%),Kelembapan_Tanah(%),"
          "Kategori_Tanah,Akumulasi_Pompa_Nyala,Akumulasi_Durasi_Detik,Raw_ADC,"
          "Suhu_Satelit(C),Kondisi_Satelit,Prediksi_Hujan"));
    file.close();
  }
}

void appendLogData() {
  if (LittleFS.exists("/log.csv")) {
    File checkFile = LittleFS.open("/log.csv", FILE_READ);
    if (checkFile && checkFile.size() > 50000) {
      checkFile.close();
      Serial.println(F("🧹 [LITTLEFS] File log melebihi 50KB. Auto-Wipe..."));
      writeLogHeader();
    } else {
      checkFile.close();
    }
  } else {
    writeLogHeader();
  }

  File file = LittleFS.open("/log.csv", FILE_APPEND);
  if (file) {
    String timeStampStr = satTime;
    if (timeStampStr == "-") {
      unsigned long sec = millis() / 1000;
      timeStampStr = "Uptime " + String(sec / 3600) + "h " +
                     String((sec % 3600) / 60) + "m";
    }
    file.print(timeStampStr);
    file.print(',');
    file.print(lastSuhuC, 1);
    file.print(',');
    file.print(lastKelembapanUdara, 1);
    file.print(',');
    file.print(latestMoisturePercent);
    file.print(',');
    file.print(getSoilCategory(latestMoisturePercent));
    file.print(',');
    file.print(pumpCount);
    file.print(',');
    file.print(totalPumpSecs);
    file.print(',');
    file.print(latestRawAdc);
    file.print(',');
    file.print(satTemp);
    file.print(',');
    file.print(satDesc);
    file.print(',');
    file.println(satRainPred);
    file.close();
    Serial.println(F("💾 [LITTLEFS] Data log database berhasil dicatat & aman tersimpan."));
  }
}

unsigned long lastDhtReadTime = 0;

void checkSystemStatus() {
  if (millis() - lastDhtReadTime >= 1000) {
    lastDhtReadTime = millis();
    float suhu = dht.readTemperature();
    float suhuF = dht.readTemperature(true);
    float kelembapan = dht.readHumidity();

    bool dhtError = isnan(suhu) || isnan(suhuF) || isnan(kelembapan);
    if (!dhtError && suhu > 0.0) {
      lastSuhuC = suhu;
      lastSuhuF = suhuF;
      lastKelembapanUdara = kelembapan;
      lastHeatIndexC = dht.computeHeatIndex(suhu, kelembapan, false);
      lastHeatIndexF = dht.computeHeatIndex(suhuF, kelembapan, true);

      float a = 17.271, b = 237.7;
      float gamma = (a * suhu / (b + suhu)) + log(kelembapan / 100.0);
      lastDewPoint = (b * gamma) / (a - gamma);
    }
  }

  // 1. TIMEOUT REALTIME SINYAL ESP8266: JIKA TERPUTUS >8 DETIK -> PERINGATAN DARURAT SAKLAR MERAH KEDIP!
  bool espNowTimeout = (lastRecvTime != 0 && (millis() - lastRecvTime > 8000));

  // 2. CEK APABILA KABEL RELAY (PIN 26) DICABUT / DISCONNECTED
  pinMode(RELAY1, INPUT_PULLUP);
  int pinFeedback = digitalRead(RELAY1);
  pinMode(RELAY1, OUTPUT);
  digitalWrite(RELAY1, isRelayOn ? LOW : HIGH);
  isRelayUnplugged = (pinFeedback == LOW && !isRelayOn && millis() > 10000);

  if (espNowTimeout) {
    isEsp8266Unplugged = true;
    systemErrorMsg = F("🚨 PERINGATAN: SINYAL ESP8266 TERPUTUS / MATI! (Sinyal Hilang >8s)");
    isSystemError = true;
    isStartupWaiting = false;
  } else if (isRelayUnplugged) {
    systemErrorMsg = F("🚨 PERINGATAN HARDWARE: KABEL RELAY PIN 26 TERLEPAS!");
    isSystemError = true;
    isStartupWaiting = false;
  } else if (lastRecvTime == 0) {
    unsigned long elapsedWait = millis() - startupWaitStartTime;
    waitingPercent = constrain(map(elapsedWait, 0, 5000, 0, 100), 0, 100);

    if (elapsedWait >= 5000) {
      // SETELAH 5 DETIK TANPA ESP8266 -> SENSOR DIDEKLARASIKAN TERPUTUS / MATI!
      isStartupWaiting = false;
      isEsp8266Unplugged = true;
      isSystemError = true;
      systemErrorMsg = F("🚨 PERINGATAN: ESP8266 TIDAK MENGIRIM DATA (MATI / TERPUTUS)!");
    } else {
      isStartupWaiting = true;
      isSystemError = false;
      isEsp8266Unplugged = false;
      systemErrorMsg = "⏳ MENUNGGU KONEKSI SENSOR [" + String(waitingPercent) + "%] (Lampu Kuning Berkedip)";
    }
  } else {
    isEsp8266Unplugged = false;
    isSystemError = false;
    isStartupWaiting = false;
    waitingPercent = 100;
    systemErrorMsg = "";
  }
}

// ==== API WEB SERVER ====
void handleRoot() { server.send_P(200, "text/html", index_html); }

void handleData() {
  String bgClass = F("aman");
  String textStatus = F("KONDISI 3: AMAN (Suhu Adem & Lembab)");

  if (isEsp8266Unplugged || latestMoisturePercent < 0) {
    bgClass = F("bahaya");
    textStatus = F("🚨 PERINGATAN: SINYAL ESP8266 TERPUTUS!");
  } else if (isRelayUnplugged) {
    bgClass = F("peringatan");
    textStatus = F("🚨 PERINGATAN: RELAY PIN 26 DICABUT!");
  } else if (lastSuhuC >= suhuBahaya) {
    bgClass = F("bahaya");
    textStatus = F("KONDISI 1: BAHAYA (Suhu Panas Ekstrem!)");
  } else if (lastSuhuC > batasSuhu || latestMoisturePercent < 45) {
    bgClass = F("peringatan");
    textStatus = F("PERINGATAN (Waktu Menyiram)");
  }

  size_t fsUsed = 0;
  if (LittleFS.exists("/log.csv")) {
    File f = LittleFS.open("/log.csv", FILE_READ);
    if (f) {
      fsUsed = f.size();
      f.close();
    }
  }
  size_t fsTotal = LittleFS.totalBytes();

  int signalQuality = constrain(map(esp8266Rssi, -95, -50, 0, 100), 0, 100);
  uint8_t connectedClients = WiFi.softAPgetStationNum();

  uint8_t dhtHealth = (isnan(lastSuhuC) || lastSuhuC == 0.0) ? 50 : 100;
  uint8_t soilHealth = (lastRecvTime == 0 || millis() - lastRecvTime > 8000) ? 0 : 100;

  float relayLifePercent = 100.0 - ((float)pumpCount / 1000.0);
  if (relayLifePercent < 0)
    relayLifePercent = 0;

