Updour/smart-farming/esp32_server_receiver/esp32_server_receiver.ino
  float waterLiters = ((float)totalPumpSecs / 60.0) * 60.0;
  float kWhUsed = ((float)totalPumpSecs / 3600.0) * 0.25;
  float costIdr = kWhUsed * 415.0;

  float tempDiff = 0.0;
  if (satTemp != "-") {
    tempDiff = lastSuhuC - satTemp.toFloat();
  }

  String json;
  json.reserve(1024);
  json = "{";
  json += "\"suhuC\":\"" + String(lastSuhuC, 1) + "\",";
  json += "\"suhuF\":\"" + String(lastSuhuF, 1) + "\",";
  json += "\"hum\":\"" + String(lastKelembapanUdara, 1) + "\",";
  json += "\"heatC\":\"" + String(lastHeatIndexC, 1) + "\",";
  json += "\"heatF\":\"" + String(lastHeatIndexF, 1) + "\",";
  json += "\"dew\":\"" + String(lastDewPoint, 1) + "\",";
  json += "\"soil\":\"" + String(latestMoisturePercent < 0 ? 0 : latestMoisturePercent) + "\",";
  json += "\"soilCategory\":\"" + getSoilCategory(latestMoisturePercent) + "\",";
  json += "\"soilDepletion\":\"" + getSoilDepletionTime() + "\",";
  json += "\"plantSummary\":\"" + getPlantHealthSummary() + "\",";
  json += "\"rawAdc\":\"" + String(latestRawAdc) + "\",";
  json += "\"nodeBat\":\"" + String(esp8266Battery) + "\",";
  json += "\"statusColor\":\"" + bgClass + "\",";
  json += "\"statusText\":\"" + textStatus + "\",";
  json += "\"errorMsg\":\"" + systemErrorMsg + "\",";
  json += "\"isWaiting\":" + String(isStartupWaiting ? 1 : 0) + ",";
  json += "\"waitingPercent\":" + String(waitingPercent) + ",";
  json += "\"satTemp\":\"" + satTemp + "\",";
  json += "\"satDesc\":\"" + satDesc + "\",";
  json += "\"satRainPred\":\"" + satRainPred + "\",";
  json += "\"satTime\":\"" + satTime + "\",";
  json += "\"tempDiff\":\"" + String(tempDiff, 1) + "\",";
  json += "\"isManual\":" + String(isManualMode ? 1 : 0) + ",";
  json += "\"relayOn\":" + String(isRelayOn ? 1 : 0) + ",";
  json += "\"cooldown\":" + String(relayCooldown ? 1 : 0) + ",";

  json += "\"hourlyCount\":" + String(hourlyPumpCount) + ",";
  json += "\"hourlySecs\":" + String(hourlyPumpSecs) + ",";
  json += "\"uptime\":\"" + getUptime() + "\",";
  json += "\"freeHeap\":" + String(ESP.getHeapSize() > 0 ? (ESP.getFreeHeap() / 1024) : 210) + ",";
  json += "\"pumpCount\":" + String(pumpCount) + ",";
  json += "\"totalPumpSecs\":" + String(totalPumpSecs) + ",";
  json += "\"waterLiters\":\"" + String(waterLiters, 1) + "\",";
  json += "\"kWhUsed\":\"" + String(kWhUsed, 3) + "\",";
  json += "\"costIdr\":\"" + String(costIdr, 1) + "\",";
  json += "\"evaporation\":\"" + String(calculateEvaporationRate(), 1) + "\",";
  json += "\"fsUsed\":" + String(fsUsed / 1024) + ",";
  json += "\"fsTotal\":" + String(fsTotal / 1024) + ",";
  json += "\"rssi\":" + String(esp8266Rssi) + ",";
  json += "\"signalQuality\":" + String(signalQuality) + ",";
  json += "\"clients\":" + String(connectedClients) + ",";
  json += "\"farmHealth\":" + String(calculateFarmHealth()) + ",";
  json += "\"dhtHealth\":" + String(dhtHealth) + ",";
  json += "\"soilHealth\":" + String(soilHealth) + ",";
  json += "\"espVcc\":\"3.3V (Stabil)\",";
  json += "\"relayLife\":\"" + String(relayLifePercent, 1) + "\"";
  json += "}";

  server.send(200, "application/json", json);
}

void handlePushWeather() {
  if (server.hasArg("temp") && server.hasArg("desc") && server.hasArg("time")) {
    satTemp = server.arg("temp");
    satDesc = server.arg("desc");
    if (server.hasArg("rain"))
      satRainPred = server.arg("rain");
    satTime = server.arg("time");
    appendLogData();
    server.send(200, "text/plain", F("Data Satelit Sukses Diterima!"));
  } else {
    server.send(400, "text/plain", F("Data Tidak Lengkap"));
  }
}

void handleDownloadLog() {
  if (LittleFS.exists("/log.csv")) {
    File file = LittleFS.open("/log.csv", FILE_READ);
    server.streamFile(file, "text/csv");
    file.close();
  } else {
    server.send(404, "text/plain", F("Log Belum Ada"));
  }
}

void handleClearLogs() {
  writeLogHeader();
  pumpCount = 0;
  totalPumpSecs = 0;
  hourlyPumpCount = 0;
  hourlyPumpSecs = 0;
  Serial.println(F("🧹 [LITTLEFS] Berkas Log & Seluruh Counter Akumulasi Pompa Berhasil Direset Total!"));
  server.send(200, "text/plain", F("Log Storage & Counter Pompa Berhasil Direset Total!"));
}

void handleSetMode() {
  if (server.hasArg("m"))
    isManualMode = (server.arg("m") == "manual");
  server.send(200, "text/plain", F("OK"));
}

void handleToggleRelay() {
  isManualMode = true;
  if (server.hasArg("s")) {
    manualRelayState = (server.arg("s") == "on");
  }

  if (manualRelayState && !isSystemError && !isEsp8266Unplugged && latestMoisturePercent >= 0) {
     digitalWrite(RELAY1, LOW); // INSTAN ON KE PIN 26
     isRelayOn = true;
     Serial.println(F("⚡ [WEB OVERRIDE] MANUAL NYALAKAN POMPA -> PIN 26 DIBERI SINYAL LOW (0V) (ON!)"));
  } else {
     digitalWrite(RELAY1, HIGH); // INSTAN OFF KE PIN 26
     isRelayOn = false;
     Serial.println(F("⚡ [WEB OVERRIDE] MANUAL MATIKAN POMPA / FAILSAFE LOCK -> PIN 26 DIBERI SINYAL HIGH (3.3V) (OFF!)"));
  }

  server.send(200, "text/plain", F("OK"));
}

void handleReboot() {
  server.send(200, "text/plain", F("Rebooting ESP32 System..."));
  delay(1000);
  ESP.restart();
}

// ==== UTAMA: LOGIKA 3 KONDISI REAL-TIME MURNI DENGAN HARDWARE FAILSAFE LOCK ====
void updateRelayState() {
  bool butuhON = false;

  // HARDWARE FAILSAFE INTERLOCK UTAMA: JIKA SINYAL TERPUTUS / ESP8266 DICABUT / MATI / HARDWARE ERROR / TANAH TERGENANG >=90%
  if (isSystemError || isEsp8266Unplugged || isRelayUnplugged || latestMoisturePercent < 0 || isStartupWaiting) {
     // MUTLAK KUNCI SAKLAR RELAY PIN 26 MATI TOTAL! (AUTO EXIT MANUAL)
     isRelayOn = false;
     isManualMode = false;
     manualRelayState = false;
     digitalWrite(RELAY1, HIGH); // SANGAT TEGAS PAKSA PIN 26 HIGH (3.3V / OFF)!
     return;
  }

  if (latestMoisturePercent >= 90) {
     butuhON = false;
     isManualMode = false;
     manualRelayState = false;
     relayCooldown = false;
  } else if (isManualMode) {
     butuhON = manualRelayState;
  } else {
     // KONDISI 1 (Panas Ekstrem >= 35C) ATAU KONDISI 2 (Menyiram: Suhu > 30C ATAU Tanah < 45%)
     if (lastSuhuC >= suhuBahaya || lastSuhuC > batasSuhu || latestMoisturePercent < 45) {
        butuhON = true;
     } else {
        // KONDISI 3 (Aman: Suhu <= 30C DAN Tanah Lembab >= 45%)
        butuhON = false;
        relayCooldown = false;
     }

