Updour/smart-farming/esp32_server_receiver/esp32_server_receiver.ino
     if (butuhON && relayCooldown)
        butuhON = false;
  }

  if (butuhON) {
    if (!isRelayOn) {
      isRelayOn = true;
      pumpCount++;
      hourlyPumpCount++;
      relayStartTime = millis();
      digitalWrite(RELAY1, LOW);
      Serial.println(F("⚡ [RELAY HARDWARE] PIN 26 DIBERI SINYAL LOW (0V) -> RELAY ON 1X!"));
    } else {
      if (!isManualMode && (millis() - relayStartTime >= MAX_RELAY_TIME)) {
        relayCooldown = true;
        isRelayOn = false;
        digitalWrite(RELAY1, HIGH);
        Serial.println(F("🚨 [RELAY] 20 MENIT NONSTOP TERCAPAI -> AUTO COOLDOWN LOCK!"));
      } else {
        digitalWrite(RELAY1, LOW);
      }
    }
  } else {
    isRelayOn = false;
    digitalWrite(RELAY1, HIGH); // PIN 26 GINJAL KUNCI MATI (HIGH / 3.3V)
  }
}

// ==== LOGIKA SEJATI INDIKATOR LAMPU TRAFFIC LIGHT (ACTIVE HIGH / COMMON GND) ====
void updateLEDState() {
  if (isSystemError || isEsp8266Unplugged || latestMoisturePercent < 0) {
     // 1. SINYAL HILANG / TERPUTUS / DICABUT -> LAMPU MERAH BERKEDIP (250ms)!
     digitalWrite(LED_HIJAU, LOW);  // OFF
     digitalWrite(LED_KUNING, LOW); // OFF
     digitalWrite(LED_MERAH, ((millis() / 250) % 2) ? HIGH : LOW); // HIGH = NYALA
  } else if (isStartupWaiting) {
     // 2. AWAL BOOT / MENUNGGU KONEKSI (WAITING) -> LAMPU KUNING BERKEDIP (500ms)!
     digitalWrite(LED_HIJAU, LOW);  // OFF
     digitalWrite(LED_MERAH, LOW);  // OFF
     digitalWrite(LED_KUNING, ((millis() / 500) % 2) ? HIGH : LOW); // HIGH = NYALA
  } else {
     // 3. KONDISI 1: BAHAYA PANAS (>= 35.0 C) -> LAMPU MERAH SOLID ON
     if (lastSuhuC >= suhuBahaya) {
        digitalWrite(LED_HIJAU, LOW);  // OFF
        digitalWrite(LED_KUNING, LOW); // OFF
        digitalWrite(LED_MERAH, HIGH); // HIGH = NYALA SOLID
     } 
     // 4. KONDISI 2: PERINGATAN MENYIRAM (> 30.0 C ATAU TANAH < 45%) -> LAMPU KUNING SOLID ON
     else if (lastSuhuC > batasSuhu || latestMoisturePercent < 45) {
        digitalWrite(LED_HIJAU, LOW);  // OFF
        digitalWrite(LED_MERAH, LOW);  // OFF
        digitalWrite(LED_KUNING, HIGH); // HIGH = NYALA SOLID
     } 
     // 5. KONDISI 3: AMAN (SUHU <= 30.0 C DAN TANAH >= 45%) -> LAMPU HIJAU SOLID ON
     else {
        digitalWrite(LED_KUNING, LOW); // OFF
        digitalWrite(LED_MERAH, LOW);  // OFF
        digitalWrite(LED_HIJAU, HIGH); // HIGH = NYALA SOLID
     }
  }
}

unsigned long lastSerialPrintTime = 0;

void setup() {
  Serial.begin(115200);
  startupWaitStartTime = millis(); // REKAM DETIK AWAL MASA TUNGGU SEJAK BOOT

  if (!LittleFS.begin(true)) {
    Serial.println(F("Gagal Inisialisasi LittleFS!"));
  } else {
    if (!LittleFS.exists("/log.csv"))
      writeLogHeader();
  }

  dht.begin();
  pinMode(RELAY1, OUTPUT);
  digitalWrite(RELAY1, HIGH); // SANGAT TEGAS INSIALISASI AWAL MATI (HIGH / 3.3V)

  pinMode(LED_HIJAU, OUTPUT);
  pinMode(LED_KUNING, OUTPUT);
  pinMode(LED_MERAH, OUTPUT); // TRAFFIC LIGHT LEDS (PIN 32, 33, 27)

  // Inisialisasi awal lampu LED (SEMUA MATI SEJAK BOOT)
  digitalWrite(LED_HIJAU, LOW);
  digitalWrite(LED_KUNING, LOW);
  digitalWrite(LED_MERAH, LOW);

  WiFi.mode(WIFI_AP_STA);
  WiFi.softAP("SmartFarm-ESP32", "12345678", 1);

  // DONGKRAK POWER MAKSIMAL RADIO ESP32 (84 * 0.25dBm = +21 dBm MAX POWER)
  esp_wifi_set_max_tx_power(84);

  // LOCK KANAL RADIO PHY ESP32 PERMANEN KE KANAL 1
  esp_wifi_set_promiscuous(true);
  esp_wifi_set_channel(1, WIFI_SECOND_CHAN_NONE);
  esp_wifi_set_promiscuous(false);

  if (esp_now_init() != ESP_OK)
    return;

#if defined(ESP_IDF_VERSION_MAJOR) && ESP_IDF_VERSION_MAJOR >= 5
  esp_now_register_recv_cb(esp_now_recv_info_t_wrapper);
#else
  esp_now_register_recv_cb((esp_now_recv_cb_t)esp_now_recv_info_t_wrapper);
#endif

  server.on("/", handleRoot);
  server.on("/data", handleData);
  server.on("/pushWeather", HTTP_POST, handlePushWeather);
  server.on("/downloadLog", HTTP_GET, handleDownloadLog);
  server.on("/clearLogs", HTTP_POST, handleClearLogs);
  server.on("/setMode", handleSetMode);
  server.on("/toggleRelay", handleToggleRelay);
  server.on("/reboot", HTTP_POST, handleReboot);
  server.begin();
}

void loop() {
  server.handleClient();

  checkSystemStatus();

  updateRelayState();

  updateLEDState();

  if (isRelayOn) {
    if (millis() - lastPumpSecUpdate >= 1000) {
      lastPumpSecUpdate = millis();
      totalPumpSecs++;
      hourlyPumpSecs++;
    }
  }

  if (millis() - lastLogTime >= LOG_INTERVAL) {
    lastLogTime = millis();
    appendLogData();
  }

  if (newDataReceived) {
    Serial.println(F("-----------------------------------------"));
    Serial.print(F("[ESP-NOW INSTAN 1s] SUKSES terima data! Tanah: "));
    Serial.print(latestMoisturePercent);
    Serial.print(F("% ("));
    Serial.print(getSoilCategory(latestMoisturePercent));
    Serial.print(F(") | Raw ADC: "));
    Serial.print(latestRawAdc);
    Serial.print(F(" | Sinyal Kebun: "));
    Serial.print(esp8266Rssi);
    Serial.println(F(" dBm"));
    Serial.println(F("-----------------------------------------"));
    newDataReceived = false;
  }

  if (millis() - lastSerialPrintTime >= 1000) { // PRINT LOG REALTIME 1 DETIK!
    lastSerialPrintTime = millis();

    if (!isSystemError && wasInErrorState) {
      Serial.println(F("\n✅ =========================================="));
      Serial.println(F("✅ SYSTEM RECOVERY: Sinyal Radio ESP8266 Terhubung Kembali!"));
      Serial.println(F("============================================="));
      wasInErrorState = false;
    }

    if (isSystemError || isEsp8266Unplugged) {
      wasInErrorState = true;
      Serial.println(F("\n🚨 ========= PERINGATAN HARDWARE DARURAT ========="));
      Serial.print(F("🚨 STATUS  : "));
      Serial.println(systemErrorMsg);
      Serial.println(F("🔴 INDIKATOR: LAMPU TRAFFIC MERAH BERKEDIP (ESP8266 TERPUTUS / MATI) | RELAY POMPA MUTLAK KUNCI MATI!"));
      Serial.println(F("=================================================="));
    } else if (isStartupWaiting) {
      wasInErrorState = true;
      unsigned long elSec = (millis() - startupWaitStartTime) / 1000;
      Serial.println(F("\n⏳ ========= MENUNGGU SENSOR KEBUN ========="));
      Serial.print(F("⏳ PROGRES MENUNGGU : ["));
      Serial.print(waitingPercent);
      Serial.print(F("%] | Waktu: "));
      Serial.print(elSec);
      Serial.println(F("s / 5s (Lampu Kuning Berkedip)"));
      Serial.println(F("============================================="));
    } else {
      Serial.println(F("☁️ ========= DATA CUACA (DHT11) ========="));
      Serial.print(F("🌡️ Suhu Udara       : "));
      Serial.print(lastSuhuC);
      Serial.print(F(" °C  |  "));
      Serial.print(lastSuhuF);
      Serial.println(F(" °F"));
      Serial.print(F("💧 Kelembapan Udara : "));
      Serial.print(lastKelembapanUdara);
      Serial.println(F(" %"));
      Serial.print(F("🔥 Terasa Seperti   : "));
      Serial.print(lastHeatIndexC);
      Serial.print(F(" °C  |  "));
      Serial.print(lastHeatIndexF);
      Serial.println(F(" °F"));
      Serial.print(F("❄️ Titik Embun (Dew): "));
      Serial.print(lastDewPoint);
      Serial.println(F(" °C"));
      Serial.print(F("🌱 Status Tanah     : "));
      Serial.println(getSoilCategory(latestMoisturePercent));
      Serial.print(F("📊 Raw ADC A0       : "));
      Serial.println(latestRawAdc);
      Serial.print(F("⚡ Stabilitas VCC   : 3.3V (Stabil)\n"));
      Serial.print(F("🧠 Free Heap RAM    : "));
      Serial.print(ESP.getHeapSize() > 0 ? (ESP.getFreeHeap() / 1024) : 210);
      Serial.println(F(" KB"));
      Serial.print(F("🤖 Kesimpulan AI    : "));
      Serial.println(getPlantHealthSummary());
      Serial.println(F("========================================="));

      if (lastSuhuC >= suhuBahaya) {
        Serial.print(F(" => STATUS: KONDISI 1: BAHAYA (PANAS EKSTREM) [LAMPU MERAH SOLID]"));
      } else if (lastSuhuC > batasSuhu || latestMoisturePercent < 45) {
        Serial.print(F(" => STATUS: KONDISI 2: PERINGATAN (WAKTU MENYIRAM) [LAMPU KUNING SOLID]"));
      } else {
        Serial.print(F(" => STATUS: KONDISI 3: AMAN (RELIABLY OFF) [LAMPU HIJAU SOLID]"));
      }

      if (isRelayOn) {
        unsigned long timeElapsed = millis() - relayStartTime;
        unsigned long timeLeft = (MAX_RELAY_TIME > timeElapsed)
                                     ? (MAX_RELAY_TIME - timeElapsed) / 1000
                                     : 0;
        Serial.print(F(" | RELAY ON (Sisa Waktu Nyala: "));
        Serial.print(timeLeft / 60);
        Serial.print(F("m "));
        Serial.print(timeLeft % 60);
        Serial.println(F("s)"));
      } else if (relayCooldown) {
        Serial.println(F(" | RELAY DIPAKSA OFF (Cooldown/Pendinginan Mesin!)"));
      } else {
        Serial.println(F(" | RELAY OFF"));
      }
    }
  }
}
